/*
Написать приложение Погода.
Для загрузки погоды используйте:
https://openweathermap.org/api/hourly-forecast
Функционал приложения:
1. При первом входе пользователь должен выбрать свой город*
2. На основном экране должна показываться детальная информация о погоде в городе с момента открытия приложения на ближайшие сутки (24 часа)
3. Реализовать просмотр погоды на последующие дни.
Например, на предстоящую неделю.
4. Реализовать возможность добавлять дополнительные города*
5. Реализовать навигацию между экранами городов*
* Механизм реализации на ваше усмотрение
Приложение должно быть интуитивно понятным, внешне приятным и соответствовать современным гайдам платформы.
Ссылка на репозиторий, который содержит ваш проект
и README:
• Фамилия Имя
• Тестовое задание Mobile (Swift или Kotlin или Flutter)
• Описание проекта
• Подготовительные действия (установки, настройки и т.д) для успешной работы проекта*
• Информация о доступах (логины/пароли и т.д.)*
• Описание, как запустить ваш проект
* Если требуется
*/
